Revit 2025 API
AdaptiveComponentInstanceUtils Class
 An interface for Adaptive Component Instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AdaptiveComponentInstanceUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static class AdaptiveComponentInstanceUtils
Public NotInheritable Class AdaptiveComponentInstanceUtils
public ref class AdaptiveComponentInstanceUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdaptiveComponentInstanceUtils = class end
The AdaptiveComponentInstanceUtils type exposes the following members.
Methods
Name | Description
CreateAdaptiveComponentInstance |  Creates a FamilyInstance of Adaptive Component Family.
GetInstancePlacementPointElementRefIds |  Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts.
GetInstancePointElementRefIds |  Gets Adaptive Point Element Ref ids to which the instance geometry adapts.
GetInstanceShapeHandlePointElementRefIds |  Gets Shape Handle Adaptive Point Element Ref ids to which the instance geometry adapts.
HasAdaptiveFamilySymbol |  Verifies if a FamilyInstance has an Adaptive Family Symbol.
IsAdaptiveComponentInstance |  Verifies if a FamilyInstance is an Adaptive Component Instance.
IsAdaptiveFamilySymbol |  Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
IsInstanceFlipped |  Gets the value of the flip parameter on the adaptive instance.
MoveAdaptiveComponentInstance |  Moves Adaptive Component Instance by the specified transformation.
SetInstanceFlipped |  Sets the value of the flip parameter on the adaptive instance.
Top
Example
private void CreateAdaptiveComponentInstance(Document document, FamilySymbol symbol)
{
    // Create a new instance of an adaptive component family
    FamilyInstance instance = AdaptiveComponentInstanceUtils.CreateAdaptiveComponentInstance(document, symbol);
    // Get the placement points of this instance
    IList<ElementId> placePointIds = new List<ElementId>();
    placePointIds = AdaptiveComponentInstanceUtils.GetInstancePlacementPointElementRefIds(instance);
    double x = 0;
    // Set the position of each placement point
    foreach (ElementId id in placePointIds)
    {
        ReferencePoint point = document.GetElement(id) as ReferencePoint;
        point.Position = new Autodesk.Revit.DB.XYZ(10*x, 10*Math.Cos(x), 0);
        x += Math.PI/6;
    }
}
Private Sub CreateAdaptiveComponentInstance(document As Document, symbol As FamilySymbol)
    ' Create a new instance of an adaptive component family
    Dim instance As FamilyInstance = AdaptiveComponentInstanceUtils.CreateAdaptiveComponentInstance(document, symbol)
    ' Get the placement points of this instance
    Dim placePointIds As IList(Of ElementId) = New List(Of ElementId)()
    placePointIds = AdaptiveComponentInstanceUtils.GetInstancePlacementPointElementRefIds(instance)
    Dim x As Double = 0
    ' Set the position of each placement point
    For Each id As ElementId In placePointIds
        Dim point As ReferencePoint = TryCast(document.GetElement(id), ReferencePoint)
        point.Position = New Autodesk.Revit.DB.XYZ(10 * x, 10 * Math.Cos(x), 0)
        x += Math.PI / 6
    Next
End Sub
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Autodesk.Revit.DB Namespace